app/controllers/blog_controller.rb

  def index
    @today = Date.today
    @future_plans = Plan.find(:all,
                              :conditions => ["date > ? and priority = 1", @today],
                              :order => "date Desc")
---
SELECT * FROM "plans" WHERE (date > '2009-07-08' and priority = 1) ORDER BY date Desc