app/controllers/plans_controller.rb

SELECT * FROM "plans" WHERE ("plans"."date" = '--- :first
---
  def index
    @plans = Plan.find(:all, :order => "date DESC, priority DESC")

SELECT * FROM "plans" WHERE ("plans"."id" = 1)
---
  def show
    @plan = Plan.find(params[:id])

SELECT * FROM "plans" WHERE ("plans"."id" = 1)
---
  def edit
    @plan = Plan.find(params[:id])

INSERT INTO "plans" ("created_at", "updated_at", "priority", "date", "content", "note", "finished") VALUES('2009-07-08 06:21:36', '2009-07-08 06:21:36', 0, NULL, 'RESTful Rails', '', NULL)
---
  def create
    @plan = Plan.new(params[:plan])

    respond_to do |format|
      if @plan.save

SELECT * FROM "plans" WHERE ("plans"."id" = 1)
UPDATE "plans" SET "updated_at" = '2009-07-08 07:00:44', "finished" = 'f', "date" = '2009-07-08' WHERE "id" = 1
---
  def update
    @plan = Plan.find(params[:id])

    respond_to do |format|
      if @plan.update_attributes(params[:plan])

SELECT * FROM "plans" WHERE ("plans"."id" = 3)
DELETE FROM "plans" WHERE "id" = 3
---
  def destroy
    @plan = Plan.find(params[:id])
    @plan.destroy